Revit 2027 API
RebarSplice.MoveRebarSpliceGeometry Method
 Moves the RebarSpliceGeometry with the specified vector.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MoveRebarSpliceGeometry(
	XYZ translation
)
Public Sub MoveRebarSpliceGeometry (
	translation As XYZ
)
public:
void MoveRebarSpliceGeometry(
	XYZ^ translation
)
member MoveRebarSpliceGeometry :
        translation : XYZ -> unit
Parameters
translation XYZ
 The translation vector that will be applied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace